// посмотреть блок цен, там сейчас связаны два поля по вмодел  ??(где, какие поля)

// в справочниках починить дополнительные услуги  ??(что с ними не так)

// вывести допы текстом в замере  ??(где)

// при установке бригады ты почему то инвертируешь дату из 02.09 становится 09.02)) (смотри у себя date и date_mont, я теб отдаю при изменении заказа нормально, ты у себя перезаписываешь date_mont)

// роли: какая роль - кокой id(сейчас сравниваю по строке если не "Администратор", то отобразит при изменении статуса тот или инной массив данных)